app/views/portfolios/show.html.erb


      <% @portfolio_item.technologies.each do |t| %>
---
SELECT "technologies".* FROM "technologies" WHERE "technologies"."portfolio_id" = ?  [["portfolio_id", 13]]