app/controllers/blogs_controller.rb

SELECT  "blogs".* FROM "blogs" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "blogs"
---
  def index
    @blogs = Blog.page(params[:page]).per(5)

INSERT INTO "blogs" ("title", "body", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?, ?)  [["title", "stuffity stuff v2"], ["body", "moaerasawegfr"], ["created_at", "2017-06-28 14:34:24.954773"], ["updated_at", "2017-06-28 14:34:24.954773"], ["slug", "stuffity-stuff-v2"]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save

DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 1]]
---
  def destroy
    @blog.destroy

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_blog
      @blog = Blog.friendly.find(params[:id])