app/controllers/portfolios_controller.rb

    def sort
      params[:order].each do |key, value|
        Portfolio.find(value[:id]).update(position: value[:position])
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "portfolios" SET "position" = ?, "updated_at" = ? WHERE "portfolios"."id" = ?  [["position", 1], ["updated_at", "2017-08-07 16:35:08.544991"], ["id", 3]]

   def create
     @portfolio_item = Portfolio.new(portfolio_params)

     respond_to do |format|
       if @portfolio_item.save
---
INSERT INTO "portfolios" ("title", "subtitle", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "asdgas"], ["subtitle", "asdfa"], ["body", "asdf"], ["created_at", "2017-06-21 14:48:21.414272"], ["updated_at", "2017-06-21 14:48:21.414272"]]

   def update
     respond_to do |format|
       if @portfolio_item.update(portfolio_params)
---
UPDATE "portfolios" SET "main_image" = ?, "thumb_image" = ?, "updated_at" = ? WHERE "portfolios"."id" = ?  [["main_image", "VideoStillImage.jpg"], ["thumb_image", "matrix.jpg"], ["updated_at", "2017-08-10 13:56:20.533042"], ["id", 2]]

   def destroy
     # Destroy/delete the record
     @portfolio_item.destroy
---
DELETE FROM "portfolios" WHERE "portfolios"."id" = ?  [["id", 2]]

    def set_portfolio_item
      @portfolio_item = Portfolio.find(params[:id])
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]